src/cf/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКурьерскойКомпанииПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручкаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПродажиВалюты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходИзКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходИзКассы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыводаМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаМесяцаВДатеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияКПП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/БыстрыеФормыУНФВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработка данных выбора контрагента в документах и справочниках
//
// Параметры:
//  - Параметры - Струкутра - Структура параметров для обработки
//  - ОкончаниеВводаТекста - Булево - Признак обработчика окончания ввода текста
//
// Возвращаемое значение:
//  - ДанныеВыбора - Структура - Структура обработанных данных вывода
//
Функция ДанныеВыбораКонтрагента(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт

	ДанныеВыбора = Справочники.Контрагенты.ПолучитьДанныеВыбора(Параметры);
	
	СтруктураВозвратаЮрЛицо = Новый Структура("ВидКонтрагента, Наименование, Самозанятый", ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо"),, Ложь);
	СтруктураВозвратаФизЛицо = Новый Структура("ВидКонтрагента, Наименование, Самозанятый", ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо"),, Ложь);
	СтруктураВозвратаФизЛицоСамозанятый = Новый Структура("ВидКонтрагента, Наименование, Самозанятый", ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо"),, Истина);
	СтруктураВозвратаИП = Новый Структура("ВидКонтрагента, Наименование, Самозанятый", ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель"),, Ложь);
	СтруктураВозвратаГосОрган = Новый Структура("ВидКонтрагента, Наименование, Самозанятый", ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган"),, Ложь);
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
		ДлинаСтроки  = СтрДлина(СтрокаПоиска);
		ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоиска);
		
		Если ЭтоСтрокаИНН Тогда
			
			МассивПодстрок   = Новый Массив;
			МассивПодстрок.Добавить(НСтр("ru='Создать: ИНН '"));
			ИНН = Лев(СтрокаПоиска, 12);
			ЭтоКорректныйИНН = (ДлинаСтроки = 10
				И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Истина, ""))
				ИЛИ (ДлинаСтроки = 12
				И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Ложь, ""));
			Если ЭтоКорректныйИНН Тогда
				ПолужирныйШрифт = Новый Шрифт(, , Истина);
				МассивПодстрок.Добавить(
					Новый ФорматированнаяСтрока(ИНН, ПолужирныйШрифт, ЦветаСтиля.РезультатУспехЦвет));
			Иначе
				МассивПодстрок.Добавить(ИНН);
			КонецЕсли;
			СколькоВопросов = ?(ЭтоКорректныйИНН ИЛИ ДлинаСтроки >= 12, 0, 
				?(ДлинаСтроки < 10, 10 - ДлинаСтроки, 12 - ДлинаСтроки));
			ЗнакиВопроса = Лев("????????????", СколькоВопросов);
			ЛишниеЦифры  = Сред(СтрокаПоиска, 13);
			МассивПодстрок.Добавить(
				Новый ФорматированнаяСтрока(ЗнакиВопроса + ЛишниеЦифры, , ЦветаСтиля.ЦветТекстаНекорректногоКонтрагента));
			ПредставлениеНового = Новый ФорматированнаяСтрока(МассивПодстрок);
			
			ДанныеВыбора.Добавить(СтрокаПоиска, ПредставлениеНового);
			
		Иначе
			
			СтруктураВозвратаЮрЛицо.Наименование = СтрокаПоиска;
			СтруктураВозвратаФизЛицо.Наименование = СтрокаПоиска;
			СтруктураВозвратаИП.Наименование = СтрокаПоиска;
			СтруктураВозвратаГосОрган.Наименование = СтрокаПоиска;
			СтруктураВозвратаФизЛицоСамозанятый.Наименование = СтрокаПоиска;
			
			ДоступныеВидыКонтрагентов = Новый СписокЗначений;
			
			// Поступление на счет
			Если Параметры.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				
			// Расход со счета
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.КомиссияБанка Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				
			// Расход со счета
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаГосОрган, НСтр("ru='Гос. орган'"));
				
			// Расход со счета
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыплатаСамозанятому
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыплатыСамозанятым Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаФизЛицоСамозанятый, НСтр("ru='Самозанятый'"));
				
			// Поступление в кассу
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				
			// Расход из кассы
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				
			// Расход из кассы
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаГосОрган, НСтр("ru='Гос. орган'"));
				
			// Расход из кассы
			ИначеЕсли Параметры.ВидОперации = "РасходыПриИмпорте" Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаГосОрган, НСтр("ru='Гос. орган'"));
				
			// Платежное поручение
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаГосОрган, НСтр("ru='Гос. орган'"));
				
			// Платежное поручение
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				
			// Платежное поручение
			ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатаСамозанятому
				Или Параметры.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаФизЛицоСамозанятый, НСтр("ru='Самозанятый'"));
				
			// Выплаты самозанятым
			ИначеЕсли Параметры.ВидОперации = "ВыплатыСамозанятым" Тогда
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаФизЛицоСамозанятый, НСтр("ru='Самозанятый'"));
				
			Иначе
				
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаЮрЛицо, НСтр("ru='Юр. лицо'"));
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаФизЛицо, НСтр("ru='Физ. лицо'"));
				ДоступныеВидыКонтрагентов.Добавить(СтруктураВозвратаИП, НСтр("ru='ИП'"));
				
			КонецЕсли;
			
			Для Каждого ВидКонтрагента Из ДоступныеВидыКонтрагентов Цикл
				ДобавитьВДанныеВыбора(ДанныеВыбора, ВидКонтрагента.Значение, ВидКонтрагента.Представление, Параметры.СтрокаПоиска);
			КонецЦикла;
			
			Если ОкончаниеВводаТекста Тогда
				// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
				ДанныеВыбора.Добавить(""); 
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат ДанныеВыбора;

КонецФункции

// Создание списка значений выбора при наборе текста в полях с типом Справочник.Номенклатура
//
// Параметры:
//  Параметры			 - 	Структура - создание см. ОкончаниеВводаТекста и АвтоПодбор в формах вызова.
//  ОкончаниеВводаТекста -  Булево	 - флаг вызова из процедуры ОкончаниеВводаТекста
//  БыстроеСозданиеДляНесколькихНоменклатурныхГрупп - Булево - признак, что номенклатуру нужно создавать и в том случае, если в базе включено несколько номенклатурных групп.
// 
// Возвращаемое значение:
//  ДанныеВыбора - СписокЗначений
//   *Если номенклатура с таким текстом найдена, то штатный перечень ПолучитьДанныеВыбора 
//   *Если не найдена - перечень ФорматированныхСтрок представлений видов номенклатур,
//    для выбора создания новой номенклатуры см. ДобавитьВДанныеВыбора. Функция создания
//    списка см. РаботаСНоменклатуройПовтИсп.ВидыНоменклатурыДляВыбора
Функция ДанныеВыбораНоменклатуры(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт
	
	ДанныеВыбора = Справочники.Номенклатура.ПолучитьДанныеВыбора(Параметры);
	СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
	
	ОбъектМетаданных = Метаданные.Справочники.Номенклатура;
	РазрешеноРедактированиеНоменклатуры = ПравоДоступа("Добавление", ОбъектМетаданных) Или ПравоДоступа("Изменение", ОбъектМетаданных);
	
	Если ДанныеВыбора.Количество() = 0 И РазрешеноРедактированиеНоменклатуры Тогда
		
		ВидыНоменклатурыДляВыбора = ДоступныеТипыНоменклатуры(Параметры.Отбор);
		
		ДоступнаПодсистемаРаботы = ВозможностиПриложения.КонстантаДоступнаВПриложении("ФункциональнаяОпцияИспользоватьПодсистемуРаботы");
		ДоступныТипыНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьТипыНоменклатуры");
		
		Если ДоступныТипыНоменклатуры Тогда
			
			Для Каждого ВидНоменклатуры Из ВидыНоменклатурыДляВыбора Цикл
				
				Если Не ДоступнаПодсистемаРаботы И ВидНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
					Продолжить
				КонецЕсли;
				
				СтруктураВозврата = Новый Структура("ТипНоменклатуры, Наименование, БыстроеСоздание");
				
				СтруктураВозврата.ТипНоменклатуры = ВидНоменклатуры;
				СтруктураВозврата.Наименование = СтрокаПоиска;
				СтруктураВозврата.БыстроеСоздание = Истина;
				
				ДобавитьВДанныеВыбора(ДанныеВыбора, СтруктураВозврата, Строка(ВидНоменклатуры), Параметры.СтрокаПоиска);
				
			КонецЦикла;
			
		Иначе // Доступен только тип "Запас"
			
			СтруктураВозврата = Новый Структура("ТипНоменклатуры, Наименование, БыстроеСоздание");
			СтруктураВозврата.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			СтруктураВозврата.Наименование = СтрокаПоиска;
			СтруктураВозврата.БыстроеСоздание = Истина;
			
			ДобавитьВДанныеВыбора(ДанныеВыбора, СтруктураВозврата, НСтр("ru='Товар'"), Параметры.СтрокаПоиска);
			
		КонецЕсли;
		
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить(""); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Создание списка значений выбора при наборе текста в полях с типом Справочник.Подписи
//
// Параметры:
//  Параметры			 - 	Структура - создание см. ОкончаниеВводаТекста и АвтоПодбор в формах вызова.
//  ОкончаниеВводаТекста -  Булево	 - флаг вызова из процедуры ОкончаниеВводаТекста
// 
// Возвращаемое значение:
//  ДанныеВыбора - СписокЗначений
//   *Если подпись с таким текстом найдена, то штатный перечень ПолучитьДанныеВыбора 
//   *Если не найдена - перечень ФорматированныхСтрок представлений подписей,
//    для выбора создания новой подписи см. ДобавитьВДанныеВыбора.
//
Функция ДанныеВыбораПодписи(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт
	
	ДанныеВыбора = Справочники.Подписи.ПолучитьДанныеВыбора(Параметры);
	СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		СтруктураВозврата = Новый Структура("Наименование, БыстроеСоздание");
		СтруктураВозврата.Наименование = СтрокаПоиска;
		СтруктураВозврата.БыстроеСоздание = Истина;
		ДобавитьВДанныеВыбора(ДанныеВыбора, СтруктураВозврата, НСтр("ru='Подпись'"), Параметры.СтрокаПоиска);
		
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить(""); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Создание списка значений выбора при наборе текста в полях с типом Справочник.БанковскиеСчета
//
// Параметры:
//  Параметры			 - 	Структура - создание см. ОкончаниеВводаТекста и АвтоПодбор в формах вызова.
//  ОкончаниеВводаТекста -  Булево	 - флаг вызова из процедуры ОкончаниеВводаТекста
// 
// Возвращаемое значение:
//  ДанныеВыбора - СписокЗначений
//   *Если банковский счет с таким текстом найден, то штатный перечень ПолучитьДанныеВыбора 
//   *Если не найден - перечень ФорматированныхСтрок представлений банковского счета,
//    для выбора создания новой подписи см. ДобавитьВДанныеВыбора.
//
Функция ДанныеВыбораБанковскогоСчета(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт
	
	ДанныеВыбора = Справочники.БанковскиеСчета.ПолучитьДанныеВыбора(Параметры);
	СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		
		СтруктураВозврата = Новый Структура("Владелец, НомерСчета, Банк, БыстроеСоздание");
		СтруктураВозврата.НомерСчета = СтрокаПоиска;
		СтруктураВозврата.Банк = Параметры.Банк;
		СтруктураВозврата.Владелец = Параметры.Владелец;
		СтруктураВозврата.БыстроеСоздание = Истина;
		
		ДобавитьВДанныеВыбора(ДанныеВыбора, СтруктураВозврата, НСтр("ru='Счет'"), Параметры.СтрокаПоиска);
		
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить(""); 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеТипыНоменклатуры(СтруктураОтбора)
	
	МассивТипов = Новый Массив;
	
	Если Не ТипЗнч(СтруктураОтбора) = Тип("Структура") 
		Или Не СтруктураОтбора.Свойство("ТипНоменклатуры") Тогда
		
		МассивТипов.Добавить(Перечисления.ТипыНоменклатуры.Запас);
		Возврат МассивТипов;
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураОтбора.ТипНоменклатуры) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого ЗначениеОтбора Из СтруктураОтбора.ТипНоменклатуры Цикл
			
			Если ЗначениеОтбора = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
				Продолжить
			КонецЕсли;
				
			МассивТипов.Добавить(ЗначениеОтбора);
			
		КонецЦикла;
		
	Иначе
		МассивТипов.Добавить(СтруктураОтбора.ТипНоменклатуры);
	КонецЕсли;
	
	Если Не МассивТипов.Количество() Тогда
		МассивТипов.Добавить(Перечисления.ТипыНоменклатуры.Запас)
	КонецЕсли;
	
	Возврат МассивТипов;
	
КонецФункции

// Создание представления строки выбора вида номенклатуры и добавление ее в список выбора.
//
// Параметры:
//  ДанныеВыбора	 - СписокЗначений	 - Итоговый список выбора видов номенклатур
//  ВидНоменклатуры	 - СправочникСсылка.ВидыНоменклатуры	 - 
//  Наименование	 - Строка	 -  Наименование вида номенклатуры
//  СтрокаПоиска	 - Строка	 -  Набранный пользователем текст. Создаваемое наименование карточки номенклатуры
//
Процедура ДобавитьВДанныеВыбора(ДанныеВыбора, СтруктураВозврата, Наименование, СтрокаПоиска)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ШрифтКоманды    = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста);
	ШрифтПодСтроки  = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ЦветПодстроки   = Новый Цвет(0, 175, 0);
	
	Представление = Новый ФорматированнаяСтрока(
				Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru='Создать: %1'"), Наименование) + " """, ШрифтКоманды),
				Новый ФорматированнаяСтрока(СокрЛП(СтрокаПоиска), ШрифтПодСтроки, ЦветПодстроки),
				Новый ФорматированнаяСтрока("""", ШрифтКоманды)
				);
				
	ДанныеВыбора.Добавить(СтруктураВозврата, Представление);
	
КонецПроцедуры

#КонецОбласти
